---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShouldAdjustWallParameters
source: html/56acf65a-25be-df3a-ecc9-e7d1ce972516.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShouldAdjustWallParameters Property

The best way to control top and base of the Wall is to modify the Constraints and Offset Parameters in Properties dialog.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShouldAdjustWallParameters { get; }
```